geier99/IR-NEC-Reader/inc/atmega168bit.h
//########################## 
//# 0x0C - 0x14  reserved  #
//##########################



//############################################             
//# TIFR0  (0x15)   TIFR0 – Timer/Counter 0 Interrupt Flag Register 

/* bits 7-3 reserved , read as zero*/

#define OCF0B    (2)     // Timer/Counter 0 Output Compare B Match Flag
#define OCF0A    (1)     // Timer/Counter 0 Output Compare A Match Flag
#define TOV0     (0)     // Timer/Counter0 Overflow Flag
        

//############################################             
//# TIFR1  (0x16)   TIFR1 – Timer/Counter1 Interrupt Flag Register 

/* bits 7-6 reserved , read as zero*/

#define ICF1     (5)     // Timer/Counter1, Input Capture Flag
/* bits 4-3 reserved , read as zero*/
#define OCF1B    (2)     // Timer/Counter1, Output Compare B Match Flag
#define OCF1A    (1)     // Timer/Counter1, Output Compare A Match Flag
#define TOV1     (0)     // Timer/Counter1, Overflow Flag


//############################################             
//# TIFR2  (0x17)   TIFR2 – Timer/Counter2 Interrupt Flag Register 

/* bits 7-3 reserved , read as zero*/
#define OCF2B    (2)     // Output Compare Flag 2 B
#define OCF2A    (1)     // Output Compare Flag 2 A
#define TOV2     (0)     // Timer/Counter2 Overflow Flag



//########################## 
//# 0x18 - 0x1A  reserved  #
//##########################



//############################################             
//# PCIFR  (0x1B)   PCIFR – Pin Change Interrupt Flag Register 

/* bits 7-3 reserved , read as zero*/
#define PCIF2    (2)     // Pin Change Interrupt Flag 2
#define PCIF1    (1)     // Pin Change Interrupt Flag 1
#define PCIF0    (0)     // Pin Change Interrupt Flag 0



//############################################             
//# EIFR  (0x1C)   EIFR – External Interrupt Flag Register 

/* bits 7-2 reserved , read as zero*/
#define INTF1    (1)     // External Interrupt Flag 1
#define INTF0    (0)     // External Interrupt Flag 1



//############################################             
//# EIMSK  (0x1D)   EIMSK – External Interrupt Mask Register 

/* bits 7-2 reserved , read as zero*/
#define INT1    (1)     // External Interrupt Request 1 Enable
#define INT0    (0)     // External Interrupt Request 0 Enable



//############################################             
//# GPIOR0  (0x1E)   GPIOR0 – General Purpose I/O Register 0 
//# Bit gelten auch für GPIOR1 und GPIOR2

#define GPIO7    (7)     // Data Bit
#define GPIO6    (6)     // Data Bit
#define GPIO5    (5)     // Data Bit
#define GPIO4    (4)     // Data Bit
#define GPIO3    (3)     // Data Bit
#define GPIO2    (2)     // Data Bit
#define GPIO1    (1)     // Data Bit
#define GPIO0    (0)     // Data Bit


//############################################
//#  EECR (0x1F)    EEPROM Control Register  # 

/*             (7)
                ..
               (6)    resserved  will read as zero
*/
#define EEPM1   (5)     // EEPROM Programming Mode Bit 1
#define EEPM0   (4)     // EEPROM Programming Mode Bit 0
#define EERIE   (3)     // EEPROM Ready Interrupt Enable
#define EEMPE   (2)     // EEPROM Master Write Enable
#define EEPE    (1)     // EEPROM Write Enable
#define EERE    (0)     // EEPROM Read Enable


//############################################
//# EEDR (0x20)      EEPROM Data Register (8-Bit) 

#define EEDR7   (7)     // Data Bit
#define EEDR6   (6)     // Data Bit
#define EEDR5   (5)     // Data Bit
#define EEDR4   (4)     // Data Bit
#define EEDR3   (3)     // Data Bit
#define EEDR2   (2)     // Data Bit
#define EEDR1   (1)     // Data Bit
#define EEDR0   (0)     // Data Bit






//#########################################################
//# EEARL  (0x21)    The EEPROM Address Register Low Byte #

#define EEAR7   (7)     // EEPROM Address Bits (low Byte)
#define EEAR6   (6)     // '
#define EEAR5   (5)     // '
#define EEAR4   (4)     // '
#define EEAR3   (3)     // '
#define EEAR2   (2)     // '
#define EEAR1   (1)     // '
#define EEAR0   (0)     // '

//#########################################################
//# EEARH  (0x22)    The EEPROM Address Register Low Byte #

/* reserved read as zero
#define EEAR15   (7)     // EEPROM Address Bits (low Byte)
#define EEAR14   (6)     // '
#define EEAR13   (5)     // '
#define EEAR12   (4)     // '
#define EEAR11   (3)     // '
#define EEAR10   (2)     // '
#define EEAR9    (1)     // '
*/
#define EEAR8    (0)     // '   EEAR8 is an unused bit in ATmega48 and must always be written to zero.


//############################################             
//# GTCCR  (0x23)   GTCCR – General Timer/Counter Control Register 

#define TSM      (7)     // Timer/Counter Synchronization Mode
/* bits 6-2 reserved , read as zero*/
#define PSRASY   (1)     // Prescaler Reset Timer/Counter2
#define PSRSYNC  (0)     // Prescaler Reset



//############################################             
//# TCCR0A  (0x24)   TCCR0A – Timer/Counter Control Register A 

#define COM0A1   (7)     // Compare Match Output A Mode Bits
#define COM0A0   (6)     // '
#define COM0B1   (5)     // Compare Match Output B Mode Bits
#define COM0B0   (4)     // '
/* bits 3-2 reserved , read as zero*/
#define WGM01    (1)     // Waveform Generation Mode Bits
#define WGM00    (0)     // '


//############################################             
//# TCCR0B  (0x25)   TCCR0B – Timer/Counter Control Register B 

#define FOC0A   (7)     // Force Output Compare A
#define FOC0B   (6)     // Force Output Compare B
/* bits 5-4 reserved , read as zero*/
#define WGM02   (3)     // Waveform Generation Mode Bit2 (restliche Bits siehe oben)
#define CS02    (2)     // Clock Select Bits
#define CS01    (1)     // '
#define CS00    (0)     // '


//############################################
//# TCNT0 (0x26)         Timer/Counter0 (8-Bit)  Timer/Counter1 is realized as an up counter 

#define TCNT07  (7)     // Data Bit
#define TCNT06  (6)     // Data Bit
#define TCNT05  (5)     // Data Bit
#define TCNT04  (4)     // Data Bit
#define TCNT03  (3)     // Data Bit
#define TCNT02  (2)     // Data Bit
#define TCNT01  (1)     // Data Bit
#define TCNT00  (0)     // Data Bit




//############################################
//# OCR0A  (0x27)        OCR0A – Timer/Counter0 Output Compare Register A (8-Bit) 

#define OCR0A7  (7)     // Data Bit
#define OCR0A6  (6)     // Data Bit
#define OCR0A5  (5)     // Data Bit
#define OCR0A4  (4)     // Data Bit
#define OCR0A3  (3)     // Data Bit
#define OCR0A2  (2)     // Data Bit
#define OCR0A1  (1)     // Data Bit
#define OCR0A0  (0)     // Data Bit


//############################################
//# OCR0B  (0x28)        OCR0B – Timer/Counter0 Output Compare Register B (8-Bit) 

#define OCR0B7  (7)     // Data Bit
#define OCR0B6  (6)     // Data Bit
#define OCR0B5  (5)     // Data Bit
#define OCR0B4  (4)     // Data Bit
#define OCR0B3  (3)     // Data Bit
#define OCR0B2  (2)     // Data Bit
#define OCR0B1  (1)     // Data Bit
#define OCR0B0  (0)     // Data Bit



