geier99/IR-NEC-Reader/inc/atmega168bit.h
/* bits 5-3  reserved , read as zero*/
#define ADTS2   (2)     // ADC Auto Trigger Source Bits
#define ADTS1   (1)     //  '
#define ADTS0   (0)     //  '



//#############################################################
// ADMUX  (0x7C)  SRAM      ADC Multiplexer Selection Register 

#define REFS1   (7)     // Reference Selection Bits
#define REFS0   (6)     // '
#define ADLAR   (5)     // ADC Left Adjust Result
/* bit 4 reserved , read as zero*/
#define MUX3    (3)     // Analog Channel and Gain Selection Bits
#define MUX2    (2)     // '
#define MUX1    (1)     // '
#define MUX0    (0)     // '


//######################### 
//# 0x7D (SRAM)  reserved #
//#########################



//########################################################
//# DIDR0 (0x7E)  SRAM       DIDR0 – Digital Input Disable Register 0 

/* bits 7-6  reserved , read as zero*/
#define ADC5D   (5)     // ADC5..0 Bits  Digital Input Disable
#define ADC4D   (4)     // '
#define ADC3D   (3)     // '
#define ADC2D   (2)     // '
#define ADC1D   (1)     // '
#define ADC0D   (0)     // '



//########################################################
//# DIDR1 (0x7F)  SRAM       DIDR1 – Digital Input Disable Register 1 

/* bits 7-2  reserved , read as zero*/
#define AIN1D   (1)     // Digital Input Disable Bit 1
#define AIN0D   (0)     // Digital Input Disable Bit 0



//############################################
//# TCCR1A  (0x80) SRAM    Timer/Counter1 Control Register A  

#define COM1A1  (7)     // Compare Output Mode for Channel A, Bit 1 
#define COM1A0  (6)     // Compare Output Mode for Channel A, Bit 0
#define COM1B1  (5)     // Compare Output Mode for Channel B, Bit 1
#define COM1B0  (4)     // Compare Output Mode for Channel B, Bit 0
/* bits 3-2  reserved , read as zero*/
#define WGM11   (1)     // Waveform Generation Mode Bit 1
#define WGM10   (0)     // Waveform Generation Mode Bit 0  


//############################################
//# TCCR1B  (0x81) SRAM       Timer/Counter1 Control Register B 

#define ICNC1    (7)     // Input Capture Noise Canceler
#define ICES1    (6)     // Input Capture Edge Select ICP1
// bit 5 reserved , read as zero, write as zero
#define WGM13    (4)     // Waveform Generation Mode Bits
#define WGM12    (3)     // '
#define CS12     (2)     // Clock Select Bits
#define CS11     (1)     // '
#define CS10     (0)     // '


//############################################
//# TCCR1C  (0x82) SRAM       Timer/Counter1 Control Register C 

#define FOC1A    (7)     // Input Capture Noise Canceler
#define FOC1B    (6)     // Input Capture Edge Select ICP1
// bits 5- 0 reserved , read as zero, write as zero



//######################### 
//# 0x83 (SRAM)  reserved #
//#########################



//############################################
//# TCNT1L   (0x84) SRAM     Timer/Counter1 Low Byte 

#define TCNT17  (7)     // Data Bit
#define TCNT16  (6)     // Data Bit
#define TCNT15  (5)     // Data Bit
#define TCNT14  (4)     // Data Bit
#define TCNT13  (3)     // Data Bit
#define TCNT12  (2)     // Data Bit
#define TCNT11  (1)     // Data Bit
#define TCNT10  (0)     // Data Bit


//############################################
//# TCNT1H   (0x85) SRAM     Timer/Counter1 High Byte 

#define TCNT115  (7)     // Data Bit
#define TCNT114  (6)     // Data Bit
#define TCNT113  (5)     // Data Bit
#define TCNT112  (4)     // Data Bit
#define TCNT111  (3)     // Data Bit
#define TCNT110  (2)     // Data Bit
#define TCNT19   (1)     // Data Bit
#define TCNT18   (0)     // Data Bit




//############################################
//# ICR1L   (0x86) SRAM    Input Capture Register 1  Low Byte 

#define ICR17  (7)     // Data Bit
#define ICR16  (6)     // Data Bit
#define ICR15  (5)     // Data Bit
#define ICR14  (4)     // Data Bit
#define ICR13  (3)     // Data Bit
#define ICR12  (2)     // Data Bit
#define ICR11  (1)     // Data Bit
#define ICR10  (0)     // Data Bit



//############################################
//# ICR1H   (0x87) SRAM    Input Capture Register 1  High Byte 

#define ICR115  (7)     // Data Bit
#define ICRT114  (6)     // Data Bit
#define ICRT113  (5)     // Data Bit
#define ICRT112  (4)     // Data Bit
#define ICRT111  (3)     // Data Bit
#define ICRT110  (2)     // Data Bit
#define ICRT19   (1)     // Data Bit
#define ICRT18   (0)     // Data Bit



//############################################
//# OCR1AL  (0x88)  SRAM       Output Compare Register 1 A  Low Byte

#define OCR1A7  (7)     // Data Bit
#define OCR1A6  (6)     // Data Bit
#define OCR1A5  (5)     // Data Bit
#define OCR1A4  (4)     // Data Bit
#define OCR1A3  (3)     // Data Bit
#define OCR1A2  (2)     // Data Bit
#define OCR1A1  (1)     // Data Bit
#define OCR1A0  (0)     // Data Bit



//############################################
//# OCR1AH  (0x89)  SRAM       Output Compare Register 1 A High Byte 

#define OCR1A15  (7)     // Data Bit
#define OCR1A14  (6)     // Data Bit
#define OCR1A13  (5)     // Data Bit
#define OCR1A12  (4)     // Data Bit
#define OCR1A11  (3)     // Data Bit
#define OCR1A10  (2)     // Data Bit
#define OCR1A9   (1)     // Data Bit
#define OCR1A8   (0)     // Data Bit



//############################################
//# OCR1BL  (0x8A) (SRAM)       Timer/Counter1 Output Compare Register B Low Byte 

#define OCR1B7  (7)     // Data Bit
#define OCR1B6  (6)     // Data Bit
#define OCR1B5  (5)     // Data Bit
#define OCR1B4  (4)     // Data Bit
#define OCR1B3  (3)     // Data Bit
#define OCR1B2  (2)     // Data Bit
#define OCR1B1  (1)     // Data Bit
#define OCR1B0  (0)     // Data Bit




//############################################
//# OCR1BH  (0x8B)   (SRAM)     Timer/Counter1 Output Compare Register B High Byte 

#define OCR1B15  (7)     // Data Bit
#define OCR1B14  (6)     // Data Bit1
#define OCR1B13  (5)     // Data Bit
#define OCR1B12  (4)     // Data Bit
#define OCR1B11  (3)     // Data Bit
#define OCR1B10  (2)     // Data Bit
#define OCR1B9   (1)     // Data Bit
#define OCR1B8   (0)     // Data Bit



